app/views/positions/_form.html.erb

    <%= form.label 'Assign skills' %>
    <%= form.collection_check_boxes(:skill_id, Skill.all(), :id, :name,) do |b| %>
---
SELECT "skills".* FROM "skills"