app/views/positions/index.html.erb

SELECT "skills".* FROM "skills" INNER JOIN "position_skills" ON "skills"."id" = "position_skills"."skill_id" WHERE "position_skills"."position_id" = $1  [["position_id", 28]]
SELECT COUNT(*) FROM "candidates" WHERE "candidates"."position_id" = $1  [["position_id", 28]]
---
        <td><%= position.name %></td>
        <td><%= (position.skills.map {|skill| "##{skill.name}"}).join(', ') %></td>
        <td><%= "#{position.candidates.count} applicants" %></td>