app/views/positions/show.html.erb

SELECT "skills".* FROM "skills" INNER JOIN "position_skills" ON "skills"."id" = "position_skills"."skill_id" WHERE "position_skills"."position_id" = $1  [["position_id", 28]]
---
  <strong>Skills:</strong>
  <%= (@position.skills.map {|skill| "##{skill.name}"}).join(', ') %>