app/views/positions/show.html.erb

      <tbody>
        <%  @position.candidates.reverse.each do |candidate| %>
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."position_id" = $1  [["position_id", 28]]