app/views/candidates/show.html.erb

SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "skills".* FROM "skills" INNER JOIN "position_skills" ON "skills"."id" = "position_skills"."skill_id" WHERE "position_skills"."position_id" = $1  [["position_id", 3]]
---
  <strong>Skills:</strong>
  <%= (@candidate.position.skills.map {|skill| "#{skill.name}"}).join(', ') %>