app/controllers/candidates_controller.rb

  def new
    @candidate = Candidate.new
    @positions = Position.all.order(name: :desc).pluck(:name, :id)
---
SELECT "positions"."name", "positions"."id" FROM "positions" ORDER BY "positions"."name" DESC

  def edit
    @positions = Position.all.order(name: :desc).pluck(:name, :id)
---
SELECT "positions"."name", "positions"."id" FROM "positions" ORDER BY "positions"."name" DESC

  def create
    @candidate = Candidate.new(candidate_params)

    respond_to do |format|
      if @candidate.save
---
INSERT INTO "candidates" ("fname", "lname", "email", "angelist", "linkedin", "position_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @candidate.update(candidate_params)
---
UPDATE "candidates" SET "position_id" = $1, "updated_at" = $2 WHERE "candidates"."id" = $3  [["position_id", 32], ["updated_at", "2021-06-09 17:40:59.920118"], ["id", 4]]