app/controllers/interviews_controller.rb

SELECT "interviews".* FROM "interviews" WHERE "interviews"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def set_interview
    @interview = Interview.find(params[:id])