app/controllers/interviews_controller.rb

  def index
    @interviews = Interview.all.order(created_at: :desc)
---
SELECT "interviews".* FROM "interviews" ORDER BY "interviews"."created_at" DESC

  def create
    @interview = Interview.new(interview_params)

    if @interview.save && Candidate.update(params[:interview][:candidate_id], matched: true)
---
INSERT INTO "interviews" ("candidate_id", "recruiter_id", "interview_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["candidate_id", 6], ["recruiter_id", 3], ["interview_date", "10.06.2021 18:26"], ["created_at", "2021-06-10 18:26:18.100379"], ["updated_at", "2021-06-10 18:26:18.100379"]]

  def update
    if !params[:cancel]
      @score = Score.new(score_params)
      if @score.save
---
INSERT INTO "scores" ("experience", "dynamism", "interest", "enthusiasm", "technical_skill", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["experience", 20], ["dynamism", 19], ["interest", 20], ["enthusiasm", 8], ["technical_skill", 1], ["created_at", "2021-06-11 15:38:16.718583"], ["updated_at", "2021-06-11 15:38:16.718583"]]

    def set_interview
      @interview = Interview.find(params[:id])
---
SELECT "interviews".* FROM "interviews" WHERE "interviews"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

    def cancel_interview
      if Interview.update(@interview.id, closed: true)
---
UPDATE "interviews" SET "closed" = $1, "score_id" = $2, "updated_at" = $3 WHERE "interviews"."id" = $4  [["closed", true], ["score_id", 0], ["updated_at", "2021-06-11 14:18:20.362590"], ["id", 14]]