app/controllers/positions_controller.rb

SELECT "positions".* FROM "positions" ORDER BY "positions"."name" DESC
---
  def index
    @positions = Position.all.order(name: :desc)

SELECT "position_skills"."skill_id" FROM "position_skills" WHERE "position_skills"."position_id" = $1  [["position_id", 27]]
---
  def edit
    @defaults = PositionSkill.where(position_id: @position.id).pluck(:skill_id)

INSERT INTO "skills" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "3"], ["created_at", "2021-06-09 04:39:55.470817"], ["updated_at", "2021-06-09 04:39:55.470817"]]
INSERT INTO "position_skills" ("skill_id", "position_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["skill_id", 4], ["position_id", 30], ["created_at", "2021-06-09 14:48:23.152754"], ["updated_at", "2021-06-09 14:48:23.152754"]]
INSERT INTO "positions" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "New Skill"], ["created_at", "2021-06-09 14:48:23.133378"], ["updated_at", "2021-06-09 14:48:23.133378"]]
---
  def create
    @position = Position.new(position_params)
    params[:position][:skill_id].each do |skill|
      if !skill.empty?
        @position.position_skills.build(:skill_id => skill)
      end
    end

    respond_to do |format|
      if @position.save

DELETE FROM "positions" WHERE "positions"."id" = $1  [["id", 20]]
DELETE FROM "position_skills" WHERE "position_skills"."position_id" = $1  [["position_id", 5]]
UPDATE "positions" SET "name" = $1, "updated_at" = $2 WHERE "positions"."id" = $3  [["name", "New Position"], ["updated_at", "2021-06-09 04:32:04.574286"], ["id", 19]]
---
  def update
    params[:position][:skill_id].each do |skill|
      if !skill.empty?
        @position.position_skills.build(:skill_id => skill)
      end
    end
    #perform check if there array has really changed before submitting
    PositionSkill.where(position_id: @position.id).delete_all
    respond_to do |format|
      if @position.update(position_params)

DELETE FROM "positions" WHERE "positions"."id" = $1  [["id", 21]]
---
  def destroy
    @position.destroy

SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_position
      @position = Position.find(params[:id])