app/controllers/positions_controller.rb

SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_position
      @position = Position.find(params[:id])