app/controllers/recruiters_controller.rb

  def index
    @recruiters = Recruiter.all
---
SELECT "recruiters".* FROM "recruiters"

  def edit
    @defaults = RecruiterPosition.where(recruiter_id: @recruiter.id).pluck(:position_id)
---
SELECT "recruiter_positions"."position_id" FROM "recruiter_positions" WHERE "recruiter_positions"."recruiter_id" = $1  [["recruiter_id", 2]]

  def create
    @recruiter = Recruiter.new(recruiter_params)
    params[:recruiter][:position_id].each do |position|
      if !position.empty?
        @recruiter.recruiter_positions.build(:position_id => position)
      end
    end

    respond_to do |format|
      if @recruiter.save
---
INSERT INTO "recruiter_positions" ("position_id", "recruiter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["position_id", 26], ["recruiter_id", 4], ["created_at", "2021-06-10 13:00:59.271611"], ["updated_at", "2021-06-10 13:00:59.271611"]]
INSERT INTO "recruiters" ("name", "email", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Yusif Badmus"], ["email", "yusif.badmus@gmail.com"], ["position", "Lead frontend developer"], ["created_at", "2021-06-09 15:42:17.900885"], ["updated_at", "2021-06-09 15:42:17.900885"]]

  def update
    params[:recruiter][:position_id].each do |position|
      if !position.empty?
        @recruiter.recruiter_positions.build(:position_id => position)
      end
    end

    RecruiterPosition.where(recruiter_id: @recruiter.id).delete_all
    respond_to do |format|
      if @recruiter.update(recruiter_params)
---
DELETE FROM "recruiters" WHERE "recruiters"."id" = $1  [["id", 5]]
DELETE FROM "recruiter_positions" WHERE "recruiter_positions"."recruiter_id" = $1  [["recruiter_id", 2]]
UPDATE "recruiters" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "recruiters"."id" = $4  [["name", "Joseph Zurahana"], ["email", "josp_sha@gmail.com"], ["updated_at", "2021-06-10 13:23:44.319648"], ["id", 5]]

  def destroy
    @recruiter.destroy
---
DELETE FROM "recruiters" WHERE "recruiters"."id" = $1  [["id", 2]]

    def set_recruiter
      @recruiter = Recruiter.find(params[:id])
---
SELECT "recruiters".* FROM "recruiters" WHERE "recruiters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]