app/controllers/recruiters_controller.rb

SELECT "recruiters".* FROM "recruiters" WHERE "recruiters"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
    def set_recruiter
      @recruiter = Recruiter.find(params[:id])

DELETE FROM "recruiter_positions" WHERE "recruiter_positions"."recruiter_id" = $1  [["recruiter_id", 42]]
---
    def update_recruiter_position
      RecruiterPosition.where(recruiter_id: @recruiter.id).delete_all

SELECT "recruiter_positions"."position_id" FROM "recruiter_positions" WHERE "recruiter_positions"."recruiter_id" = $1  [["recruiter_id", 9]]
---
    def set_defaults
      @defaults = !@recruiter.id.nil? ? RecruiterPosition.where(recruiter_id: @recruiter.id).pluck(:position_id) : []