app/controllers/skills_controller.rb

INSERT INTO "skills" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "marketing"], ["created_at", "2021-06-09 03:02:04.649033"], ["updated_at", "2021-06-09 03:02:04.649033"]]
---
  def create
    @skill = Skill.new(skill_params)

    respond_to do |format|
      if @skill.save

UPDATE "skills" SET "name" = $1, "updated_at" = $2 WHERE "skills"."id" = $3  [["name", "ruby on rails"], ["updated_at", "2021-06-09 03:11:10.218019"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @skill.update(skill_params)

DELETE FROM "skills" WHERE "skills"."id" = $1  [["id", 8]]
---
  def destroy
    @skill.destroy