app/views/recruiters/_form.html.erb

SELECT "positions".* FROM "positions"
---
    <%= form.label 'Assign Position' %>
    <%= form.collection_check_boxes(:position_ids, Position.all(), :id, :name,) do |b| %>