app/views/recruiters/show.html.erb

    <tbody>
      <% @recruiter.positions.each do |position| %>
---
SELECT "positions".* FROM "positions" INNER JOIN "recruiter_positions" ON "positions"."id" = "recruiter_positions"."position_id" WHERE "recruiter_positions"."recruiter_id" = $1  [["recruiter_id", 2]]